ТОИР_демо/src/ChartsOfCharacteristicTypes/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <type>
    <types>Number</types>
    <types>CatalogRef.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>4</scale>
    </numberQualifiers>
  </type>
  <attributes>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ТОИР_демо/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <resources>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/ChartsOfCharacteristicTypes/торо_ИзмеряемыеПоказателиОбъектовРемонта/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция предназначена для получения всех измеряемых показателей,
//	назначенных объекту ремонта (включая наследуемые из типового ОР).
//
//	Параметры:
//		СписокОР - СправочникСсылка.торо_ОбъектыРемонта, СписокЗначений, Массив - список ОР, для которых нужно получить показатели.
//		СписокПоказателей - ПланВидовХарактеристикСсылка.торо_ИзмеряемыеПоказателиОбъектовРемонта, 
//							СписокЗначений, Массив - список необходимых показателей (по умолчанию - Неопределено, все показатели).
//		ПолучатьГраничныеЗначения - Булево - признак для получения граничных значений показателя (по умолчанию - Ложь).
//		НеУчитыватьОР - Булево - не учитывать граничные значения, заданные для ОР индивидуально.
//		ТаблицаТиповыхОР - ТаблицаЗначений - таблица с типовыми ОР для выбранных ОР.
//
// Возвращаемое значение:
//		Массив - массив структур с данными об измеряемых показателях.
//
Функция ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(СписокОР,СписокПоказателей = Неопределено,ПолучатьГраничныеЗначения = Ложь, НеУчитыватьОР = Ложь, ТаблицаТиповыхОР = Неопределено) Экспорт
	
	Если ТаблицаТиповыхОР = Неопределено Тогда
		ЗапросТиповых = Новый Запрос;
		ЗапросТиповых.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОбъектыРемонта.ТиповойОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)
		|	И торо_ОбъектыРемонта.ТиповойОР <> ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)";
		
		ЗапросТиповых.УстановитьПараметр("Ссылка", СписокОР);
		СписокТиповых = ЗапросТиповых.Выполнить().Выгрузить().ВыгрузитьКолонку("ТиповойОР");
		
		ТаблицаРодителейТиповых = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейСпискаОбъектов(СписокТиповых, Истина, Тип("СправочникСсылка.торо_ТиповыеОР"));
		
		ЗапросТабТиповыхОР = Новый Запрос;
		ЗапросТабТиповыхОР.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРодителей.Родитель,
		|	ТаблицаРодителей.Уровень,
		|	ТаблицаРодителей.Объект
		|ПОМЕСТИТЬ ТаблицаРодителейТиповыхОР
		|ИЗ
		|	&ТаблицаРодителей КАК ТаблицаРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	ТаблицаРодителейТиповыхОР.Родитель,
		|	ТаблицаРодителейТиповыхОР.Объект,
		|	ТаблицаРодителейТиповыхОР.Уровень
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРодителейТиповыхОР КАК ТаблицаРодителейТиповыхОР
		|		ПО торо_ОбъектыРемонта.ТиповойОР = ТаблицаРодителейТиповыхОР.Объект
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&СписокОР)";

		ЗапросТабТиповыхОР.УстановитьПараметр("СписокОР",СписокОР);
		ЗапросТабТиповыхОР.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителейТиповых);
		
		ТаблицаТиповыхОР = ЗапросТабТиповыхОР.Выполнить().Выгрузить();
		
	КонецЕсли;
			
	Если НЕ ПолучатьГраничныеЗначения Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаТиповыхОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаТиповыхОР.Родитель КАК ТиповойОР,
		|	ТаблицаТиповыхОР.Уровень
		|ПОМЕСТИТЬ ТаблицаТиповыхОР
		|ИЗ
		|	&ТаблицаТиповыхОР КАК ТаблицаТиповыхОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
		|	ИСТИНА КАК Приоритет,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален,
		|	-1 КАК Уровень
		|ПОМЕСТИТЬ ПоказателиОРИТиповогоОР
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|
		|ГДЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта В(&СписокОР)
		|	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель В(&СписокПоказателей)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТиповыхОР.ОбъектРемонта,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
		|	ЛОЖЬ,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален,
		|	ТаблицаТиповыхОР.Уровень
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТиповыхОР КАК ТаблицаТиповыхОР
		|		ПО ((ВЫРАЗИТЬ(торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК Справочник.торо_ТиповыеОР)) = ТаблицаТиповыхОР.ТиповойОР)
		|ГДЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель В(&СписокПоказателей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриоритетовПолная.ОбъектРемонта,
		|	ТаблицаПриоритетовПолная.Показатель,
		|	НЕ МАКСИМУМ(ТаблицаПриоритетовПолная.Приоритет) КАК ИзТиповогоОР,
		|	МАКСИМУМ(ТаблицаПриоритетовПолная.Удален) КАК Удален
		|ИЗ
		|	ПоказателиОРИТиповогоОР КАК ТаблицаПриоритетовПолная
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриоритетовПолная.ОбъектРемонта,
		|	ТаблицаПриоритетовПолная.Показатель
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ТаблицаПриоритетовПолная.Удален) = ЛОЖЬ";

		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаТиповыхОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаТиповыхОР.Родитель КАК ТиповойОР,
		|	ТаблицаТиповыхОР.Уровень
		|ПОМЕСТИТЬ ТаблицаТиповыхОР
		|ИЗ
		|	&ТаблицаТиповыхОР КАК ТаблицаТиповыхОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаТиповыхОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаТиповыхОР.Объект КАК ТиповойОР
		|ПОМЕСТИТЬ ТаблицаТиповыхОР_Краткая
		|ИЗ
		|	&ТаблицаТиповыхОР КАК ТаблицаТиповыхОР
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &НеУчитыватьОР = ЛОЖЬ
		|			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДопустимыйМинимум,
		|	ВЫБОР
		|		КОГДА &НеУчитыватьОР = ЛОЖЬ
		|			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДопустимыйМаксимум,
		|	ВЫБОР
		|		КОГДА &НеУчитыватьОР = ЛОЖЬ
		|			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КритическийМинимум,
		|	ВЫБОР
		|		КОГДА &НеУчитыватьОР = ЛОЖЬ
		|			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КритическийМаксимум,
		|	ВЫБОР
		|		КОГДА &НеУчитыватьОР = ЛОЖЬ
		|			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗначенияКонтролируемыхПоказателейИзОР,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель КАК Показатель,
		|	ТаблицаТиповыхОР_Краткая.ТиповойОР КАК ТиповойОР,
		|	1 КАК Приоритет,
		|	ЛОЖЬ КАК ИзТиповогоОР,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален,
		|	-1 КАК Уровень
		|ПОМЕСТИТЬ ПоказателиОРИТиповогоОР
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТиповыхОР_Краткая КАК ТаблицаТиповыхОР_Краткая
		|		ПО торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = ТаблицаТиповыхОР_Краткая.ОбъектРемонта
		|ГДЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта В(&СписокОР)
		|	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель В(&СписокПоказателей)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера,
		|	ТаблицаТиповыхОР.ОбъектРемонта,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
		|	ТаблицаТиповыхОР.ТиповойОР,
		|	0,
		|	ИСТИНА,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален,
		|	ТаблицаТиповыхОР.Уровень
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТиповыхОР КАК ТаблицаТиповыхОР
		|		ПО ((ВЫРАЗИТЬ(торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК Справочник.торо_ТиповыеОР)) = ТаблицаТиповыхОР.ТиповойОР)
		|ГДЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель В(&СписокПоказателей)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОРИТиповогоОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ПоказателиОРИТиповогоОР.Показатель КАК Показатель,
		|	МИНИМУМ(ПоказателиОРИТиповогоОР.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_ПриоритетыПоУровню
		|ИЗ
		|	ПоказателиОРИТиповогоОР КАК ПоказателиОРИТиповогоОР
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиОРИТиповогоОР.ОбъектРемонта,
		|	ПоказателиОРИТиповогоОР.Показатель
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОРИТиповогоОР.ДопустимыйМинимум,
		|	ПоказателиОРИТиповогоОР.ДопустимыйМаксимум,
		|	ПоказателиОРИТиповогоОР.КритическийМинимум,
		|	ПоказателиОРИТиповогоОР.КритическийМаксимум,
		|	ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР,
		|	ПоказателиОРИТиповогоОР.ТочкаЗамера,
		|	ПоказателиОРИТиповогоОР.ОбъектРемонта,
		|	ПоказателиОРИТиповогоОР.Показатель,
		|	ПоказателиОРИТиповогоОР.ТиповойОР,
		|	ПоказателиОРИТиповогоОР.Приоритет,
		|	ПоказателиОРИТиповогоОР.ИзТиповогоОР,
		|	ПоказателиОРИТиповогоОР.Удален,
		|	ПоказателиОРИТиповогоОР.Уровень
		|ПОМЕСТИТЬ ВТ_ПриоритетныеПоказатели
		|ИЗ
		|	ПоказателиОРИТиповогоОР КАК ПоказателиОРИТиповогоОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыПоУровню КАК ВТ_ПриоритетыПоУровню
		|		ПО ПоказателиОРИТиповогоОР.ОбъектРемонта = ВТ_ПриоритетыПоУровню.ОбъектРемонта
		|			И ПоказателиОРИТиповогоОР.Показатель = ВТ_ПриоритетыПоУровню.Показатель
		|			И ПоказателиОРИТиповогоОР.Уровень = ВТ_ПриоритетыПоУровню.Уровень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриоритетовПолная.ОбъектРемонта,
		|	ТаблицаПриоритетовПолная.Показатель,
		|	МАКСИМУМ(ТаблицаПриоритетовПолная.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ТаблицаПриоритетов
		|ИЗ
		|	ВТ_ПриоритетныеПоказатели КАК ТаблицаПриоритетовПолная
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриоритетовПолная.ОбъектРемонта,
		|	ТаблицаПриоритетовПолная.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОРИТиповогоОР.Показатель,
		|	ВЫБОР
		|		КОГДА ПоказателиОРИТиповогоОР.ИзТиповогоОР
		|			ТОГДА ПоказателиОРИТиповогоОР.ТиповойОР
		|		ИНАЧЕ ПоказателиОРИТиповогоОР.ОбъектРемонта
		|	КОНЕЦ КАК ОбъектРемонта,
		|	ПоказателиОРИТиповогоОР.ТиповойОР,
		|	ВЫБОР
		|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
		|			ТОГДА ПоказателиОРИТиповогоОР.ДопустимыйМинимум
		|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум
		|	КОНЕЦ КАК ДопустимыйМинимум,
		|	ВЫБОР
		|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
		|			ТОГДА ПоказателиОРИТиповогоОР.ДопустимыйМаксимум
		|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум
		|	КОНЕЦ КАК ДопустимыйМаксимум,
		|	ВЫБОР
		|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
		|			ТОГДА ПоказателиОРИТиповогоОР.КритическийМинимум
		|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум
		|	КОНЕЦ КАК КритическийМинимум,
		|	ВЫБОР
		|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
		|			ТОГДА ПоказателиОРИТиповогоОР.КритическийМаксимум
		|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум
		|	КОНЕЦ КАК КритическийМаксимум,
		|	ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР,
		|	ПоказателиОРИТиповогоОР.ТочкаЗамера,
		|	ПоказателиОРИТиповогоОР.Удален,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЕдиницаИзмерения,
		|	ПоказателиОРИТиповогоОР.ИзТиповогоОР
		|ИЗ
		|	ВТ_ПриоритетныеПоказатели КАК ПоказателиОРИТиповогоОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПриоритетов КАК ТаблицаПриоритетов
		|		ПО ПоказателиОРИТиповогоОР.ОбъектРемонта = ТаблицаПриоритетов.ОбъектРемонта
		|			И ПоказателиОРИТиповогоОР.Показатель = ТаблицаПриоритетов.Показатель
		|			И ПоказателиОРИТиповогоОР.Приоритет = ТаблицаПриоритетов.Приоритет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|		ПО ПоказателиОРИТиповогоОР.Показатель = торо_ИзмеряемыеПоказателиОбъектовРемонта.Ссылка
		|ГДЕ
		|	НЕ ПоказателиОРИТиповогоОР.Удален";

	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если СписокПоказателей <> Неопределено Тогда
		Запрос.УстановитьПараметр("СписокПоказателей",СписокПоказателей);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель В(&СписокПоказателей)","Истина");
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокОР",СписокОР);
	Запрос.УстановитьПараметр("НеУчитыватьОР",НеУчитыватьОР);
	Запрос.УстановитьПараметр("ТаблицаТиповыхОР", ТаблицаТиповыхОР);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(Результат);
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
КонецФункции

#КонецОбласти
